
/**********************************文件头部注释************************************/
//
//
//  					Copyright (C), 2005-2010, AV Frontier Tech. Co., Ltd.
//
//
// 文件名：		trace.h
//
// 创建者：		mjj
//
// 创建日期：	2007/12/12
//
// 文件描述：	打印模块的头文件
//
// 当前维护者：(  由API  组指定人员负责维护)
//
//  最后更新：	2007/12/12
//
//
/*****************************************************************************************/


#ifndef __YWTRACE_H
#define __YWTRACE_H


#ifdef __cplusplus
extern "C" {
#endif

/************************************文件包含****************************************/



/************************************宏定义*******************************************/

#define TRACE_TIMESTAMP			0x10000000

enum ywtrace_level_e
{
	TRACE_FATAL	= 0x01,
	TRACE_ERROR	= 0x02,
	TRACE_INFO	= 0x04,
	TRACE_OK	= 0x08,
	TRACE_MASK	= 0x0F
};

#define TRACE_MODLUE_MASK		0x00FFFFFF


/************************************数据结构****************************************/


/************************************常量定义****************************************/


/************************************变量定义****************************************/


/************************************变量引用****************************************/


/************************************函数定义****************************************/

int YWTRACE_Init ( void );
int YWTRACE_Print (const u32 level, const char * format, ...);

#ifdef __TRACE__
#define	ywtrace_init		YWTRACE_Init
#define	ywtrace_print		YWTRACE_Print
#else
#define	ywtrace_init(x...)	do{} while(0)
#define	ywtrace_print(x...)	do{} while(0)
#endif

#ifdef __cplusplus
}
#endif


#endif





