/*$Source$*/
/*****************************文件头部注释*************************************/
//
//			Copyright (C), 2013-2018, AV Frontier Tech. Co., Ltd.
//
//
// 文 件 名：	$RCSfile$
//
// 创 建 者：	D26LF
//
// 创建时间：	2013.12.11
//
// 最后更新：	$Date$
//
//				$Author$
//
//				$Revision$
//
//				$State$
//
// 文件描述：	basic types
//
/******************************************************************************/

#ifndef __BASIC_TYPES_H
#define __BASIC_TYPES_H

/********************************  文件包含************************************/


#ifdef __cplusplus
extern "C" {
#endif


/********************************  常量定义************************************/

/********************************  数据结构************************************/

/********************************  宏 定 义************************************/

/********************************  变量定义************************************/

/********************************  变量引用************************************/

/********************************  函数声明************************************/

/********************************  函数定义************************************/

#ifndef INTTYPE
typedef char			INT8;
typedef unsigned char	UINT8;

typedef short			INT16;
typedef unsigned short	UINT16;

typedef int				INT32;
typedef unsigned int	UINT32;


typedef unsigned long long	UINT64;
typedef unsigned long long	U64;

typedef long long INT64;
typedef long long S64;
#define INTTYPE
#endif

#ifdef __cplusplus
}
#endif


#endif  /* __BASIC_TYPES_H */
/* EOF------------------------------------------------------------------------*/

/* BOL-------------------------------------------------------------------*/
//$Log$
/* EOL-------------------------------------------------------------------*/

